## pandas has ability to read data abd write data to a wide variety of sources:

### For instance:
- **CSV**
- **Excel**
- **HTML**
- **SQL**

## Requirements : 
- `!conda install sqlalchemy`
- `!conda install lxml`
- `!conda install html5lib`
- `!conda install BeautifulSoup4`
- (u can also use 'pip')

In [1]:
import pandas as pd
import numpy as np

In [2]:
pwd

'E:\\AI-ML\\2_Python_for_Data_Science_and_Machine_Learning_Bootcamp\\Practice\\Python for ML\\3_Pandas-Data_Analysis'

---

# Reading from CSV files (Input):
- **`pd.read_csv('file_name.csv')`**

In [3]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# Writing to CSV files (Output) :
- **`df_name.to_csv('output_fileName.csv', index=False)`**
- here `index=False` is given to avoid index to be copied in a new column

In [5]:
df.to_csv('My_Output_CSV.csv')

In [6]:
pd.read_csv('My_Output_CSV.csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [7]:
df.to_csv('My_Output_CSV.csv', index=False)
pd.read_csv('My_Output_CSV.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

---

# Reading from Excel files (Input):
- **`pd.read_excel('fileName.xlsx', sheetname='Sheet1', index_col=0)`**
- **In case of error in fetching Excel file install 'xlrd'- `!conda install xlrd`**
- **It is same as csv files but it has different sheets**

In [8]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [9]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1', index_col=0)
# here index_col=0 is given to avoid index to be copied in a new column

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# Writing to Excel files (Output):
- **`df_name.to_excel('output_fileName.xlsx', index=False)`**

In [10]:
df.to_excel('My_Output_Excel.xlsx', sheet_name='NewSheet', index=False)

In [11]:
pd.read_excel('My_Output_Excel.xlsx')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

---

# Reading from Html (Input):
- **`pd.read_html('html_link_here'3)`**

You may need to install html5lib, lxml, and BeautifulSoup4 :
- **`!conda install lxml`**
- **`!conda install html5lib`**
- **`!conda install BeautifulSoup4`**

**NOTE:** Incase of error install with Administrator privileges in CMD Prompt

In [12]:
!conda install lxml
!conda install html5lib
!conda install BeautifulSoup4

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

In [13]:
# pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
df_htm = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [14]:
df_htm[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [15]:
df_htm[0].head(10)

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
5,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019",10533
6,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
7,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019",10531
8,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017",10530
9,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017",10529

---

# Working with SQL (Optional):

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Python’s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.


If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

* read_sql_table(table_name, con[, schema, ...])	
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])	
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])	
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])	
    * Write records stored in a DataFrame to a SQL database.

In [16]:
from sqlalchemy import create_engine
# This will allow us to create simple SQL engine in the memory

In [17]:
engine = create_engine('sqlite:///:memory:')
# creating tiny/temporary DataBase in the memory

In [18]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [19]:
df.to_sql('my_table', engine)
# writing to sql table

In [20]:
df_sql = pd.read_sql('my_table', con=engine)    #con ~ connection=engine
df_sql

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

---